# Pandas - Week 2

***

## Membalik urutan baris dan kolom pada Data Frame

### 1. Import Modules

In [3]:
import pandas as pd
import numpy as np

### 2. Persiapan Data Frame

In [4]:
n_rows = 5
n_cols = 5
cols = tuple("ABCDE")

df = pd.DataFrame(np.random.randint(1, 10, size=(n_rows, n_cols)), columns = cols)

df

   A  B  C  D  E
0  9  9  3  3  3
1  8  2  5  8  1
2  1  2  1  3  7
3  4  4  6  3  5
4  3  5  8  3  8

Pada kode di atas, akan dibuat sebuah data frame dengan menjadikan angka random sebagai populasinya (mulai dari 1 sampai 10) dengan dimensi yang telah ditentukan dengan n_rows dan n_cols.

### 3. Membalik urutan kolom

In [8]:
df.loc[:, ::-1] #Input pertama untuk baris, sedangkan input kedua untuk mengatur kolom.

   E  D  C  B  A
0  3  3  3  9  9
1  1  8  5  2  8
2  7  3  1  2  1
3  5  3  6  4  4
4  8  3  8  5  3

Untuk membalik urutan kolom, dapat digunakan fungsi loc. Input pertama pada kode di atas berupa **":"** yang berarti menyertakan setiap baris, sedangkan input kedua berupa **"::-1"** yang dimana -1 berfungsi untuk mengatur stepper. Jika nilainya -1 maka akan dilakukan pembalik urutan

### 4. Membalik urutan baris

In [9]:
df.loc[::-1] #Karena hanya diperlukan untuk mengatur baris, maka input kedua tidak wajib disertakan.

   A  B  C  D  E
4  3  5  8  3  8
3  4  4  6  3  5
2  1  2  1  3  7
1  8  2  5  8  1
0  9  9  3  3  3

### 5. Membalik urutan baris dan melakukan penyesuaian ulang index.

In [10]:
df.loc[::-1].reset_index(drop=True)

   A  B  C  D  E
0  3  5  8  3  8
1  4  4  6  3  5
2  1  2  1  3  7
3  8  2  5  8  1
4  9  9  3  3  3

Dengan kode di atas, saat dilakukan pembalikan urutan baris, hanya data point-nya saja yang terbalik, namun indexnya tetap berurutan dari 0.

***

## Mengganti nama kolom pada Data Frame

### 1. Import modules

In [11]:
import pandas as pd
import numpy as np

### 2. Persiapan Data Frame

In [13]:
n_rows = 5
n_cols = 5
cols = tuple("ABCDE")

df = pd.DataFrame(np.random.randint(1, 10, size=(n_rows, n_cols)), columns = cols)
df

   A  B  C  D  E
0  4  8  2  7  3
1  9  9  6  2  5
2  6  4  8  6  4
3  8  7  1  1  8
4  2  6  5  2  3

Kode di atas akan membuat data frame yang diisi dengan angka acak mulai dari 1 - 10 dengan dimensi yang sudah ditentukan.

### 3. Mengganti nama untuk sebuah kolom pada Data Frame

In [14]:
df.rename(columns={'C':'Hobi'})

   A  B  Hobi  D  E
0  4  8     2  7  3
1  9  9     6  2  5
2  6  4     8  6  4
3  8  7     1  1  8
4  2  6     5  2  3

Untuk mengganti label kolom, dapat digunakan fungsi **rename()** seperti kode di atas.

### 4. Mengganti nama untuk banyak kolom pada Data Frame

In [15]:
df.rename(columns={'A':'Nama', 'B':'Alamat', 'D':'Kota'}) #Dilakukan dengan menambahkan daftar kolom yang ingin diubah labelnya.

   Nama  Alamat  C  Kota  E
0     4       8  2     7  3
1     9       9  6     2  5
2     6       4  8     6  4
3     8       7  1     1  8
4     2       6  5     2  3

***

## Menghapus missing value pada Data Frame

### 1. Import modules

In [16]:
import pandas as pd
import numpy as np

### 2. Persiapan Data Frame

In [17]:
df = pd.util.testing.makeMissingDataframe().reset_index() #Digunakan untuk membuat sebuah dummy data frame dengan missing value.
df.head() #Digunakan untuk menampilkan lima data pertama saja.

D:\Anaconda\lib\site-packages\pandas\util\__init__.py:12: FutureWarning: pandas.util.testing is deprecated. Use the functions in the public API at pandas.testing instead.
  import pandas.util.testing

        index         A         B         C         D
0  YANgWesYvM  0.102614  0.650743  0.081559 -0.561965
1  xqtfDbu3YI  0.390993  0.076733  1.269120       NaN
2  dMLNclhoFv  0.740928 -0.277292 -0.860804 -0.908986
3  JsesGhTIkz  0.271258 -0.864193 -0.224681 -0.571952
4  ZImYo1dgJk  1.380945       NaN       NaN       NaN

In [18]:
df = df.rename(columns={'index':'z'}) #Mengganti nama kolom.
df.head()

            z         A         B         C         D
0  YANgWesYvM  0.102614  0.650743  0.081559 -0.561965
1  xqtfDbu3YI  0.390993  0.076733  1.269120       NaN
2  dMLNclhoFv  0.740928 -0.277292 -0.860804 -0.908986
3  JsesGhTIkz  0.271258 -0.864193 -0.224681 -0.571952
4  ZImYo1dgJk  1.380945       NaN       NaN       NaN

In [19]:
df_backup = df.copy(deep=True) #Melakukan copy data frame.

### 3. Menghapus (drop) setiap kolom yang mengandung missing values

In [21]:
df = df.dropna(axis='columns')
df.head()

            z
0  YANgWesYvM
1  xqtfDbu3YI
2  dMLNclhoFv
3  JsesGhTIkz
4  ZImYo1dgJk

Dilakukan dengan menggunakan fungsi **dropna()** lalu menyertakan axis yang ingin di-drop.

### 4. Menghapus setiap baris yang mengandung missing values.

In [22]:
df = df_backup.copy(deep=True) #Menyertakan data yang pertama di backup ke df.
df = df.dropna(axis='rows') #Menghapus baris yang mengandung missing values.
df.head()

            z         A         B         C         D
0  YANgWesYvM  0.102614  0.650743  0.081559 -0.561965
2  dMLNclhoFv  0.740928 -0.277292 -0.860804 -0.908986
3  JsesGhTIkz  0.271258 -0.864193 -0.224681 -0.571952
5  LenMGtXDmt  0.850287  1.081704 -0.535840 -0.090801
6  7IwNfrOUkb  0.298861 -1.113681 -0.099655  1.901875

### 5. Persentase missing values untuk tiap kolom.

In [23]:
df = df_backup.copy(deep=True)
df.isna().mean()

z    0.000000
A    0.166667
B    0.066667
C    0.100000
D    0.066667
dtype: float64

Dapat dilakukan dengan menggunakan fungsi **isna()** yang akan mengumpulkan semua missing value dari setiap kolom data frame dan menggunakan fungsi **mean()** untuk menghitung rata-ratanya.

### 6. Menghapus setiap kolom yang mengandung missing values berdasarkan threshold (ambang batas).

In [26]:
treshold = len(df) * 0.9 #Menentukan threshold. Pada kasus ini 90 persen.
df = df.dropna(thresh=treshold, axis='columns')
df.head()

            z         B         C         D
0  YANgWesYvM  0.650743  0.081559 -0.561965
1  xqtfDbu3YI  0.076733  1.269120       NaN
2  dMLNclhoFv -0.277292 -0.860804 -0.908986
3  JsesGhTIkz -0.864193 -0.224681 -0.571952
4  ZImYo1dgJk       NaN       NaN       NaN

Pada bagian persentase, diketahui bahwa persentase non missing values untuk kolom A sekitar 83%. Karena ambang batas yang dapat ditolerir adalah 90%, maka kolom A akan di drop.

***

## Memeriksa kesamaan antar kolom (series) pada Data Frame

### 1. Import modules

In [27]:
import pandas as pd
import numpy as np

### 2. Persiapan Data Frame

In [28]:
data = {'A':[15, 15, 10, np.nan, 12], 
       'B':[15, 15, 10, np.nan, 12]} #Nilai kedua kolom sama persis.

df = pd.DataFrame(data)
df

      A     B
0  15.0  15.0
1  15.0  15.0
2  10.0  10.0
3   NaN   NaN
4  12.0  12.0

### 3. Mengenal Pandas Series

Pandas Series adalah struktur data yang dimiliki oleh pandas. Pada dasarnya, Series adalah kolom.

In [29]:
df['A']

0    15.0
1    15.0
2    10.0
3     NaN
4    12.0
Name: A, dtype: float64

In [30]:
type(df['A']) #Data type dari kolom A adalah Series.

pandas.core.series.Series

In [31]:
type(df)

pandas.core.frame.DataFrame

### 4. Memeriksa kesamaan dengan operator ==

In [32]:
df['A'] == df['B'] #Operator "==" tidak bisa membandingkan missing values.

0     True
1     True
2     True
3    False
4     True
dtype: bool

### 5. Memeriksa kesamaan dengan method equals()

In [33]:
df['A'].equals(df['B'])

True

### 6. Memeriksa kesamaan antar dua Data Frame

In [34]:
df1 = df.copy(deep=True)

df.equals(df1)

True

In [35]:
df == df1

       A      B
0   True   True
1   True   True
2   True   True
3  False  False
4   True   True

Jika tujuannya adalah untuk membandingkan apakah dua buah data frame memiliki nilai yang sama atau identik, maka cara terbaik adalah dengan menggunakan method **equals()**.